

#+TITLE: Insert Emacs Config
#+AUTHOR: Insert5StarName

Config Is Very Messy

** Set theme
#+begin_src emacs-lisp
  (window-divider-mode)
 ;; (setq mouse-autoselect-window t)
  (global-display-line-numbers-mode)
  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	  doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-monokai-pro t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-colors") ; use doom atom for more minimal icons
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
  ;;(load-theme 'monokai t)
  (set-default 'truncate-lines t)
  (require 'elcord)
  (elcord-mode)
  (setq use-dialog-box nil)
  (use-package doom-modeline)
  (add-hook 'emacs-startup-hook 'doom-modeline-mode)
  (setq doom-themes-treemacs-enable-variable-pitch nil)
  ;;(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  ;;(add-to-list 'default-frame-alist '(fullscreen . maximized))

  (dolist (mode '(org-mode-hook
		  term-mode-hook
		  vterm-mode-hook
		  shell-mode-hook
		  eshell-mode-hook
		  treemacs-mode-hook
		  ))
    (add-hook mode(lambda() (display-line-numbers-mode 0))))

#+end_src

#+RESULTS:
| centaur-tabs-local-mode | (lambda nil (display-line-numbers-mode 0)) |

